{
  "common": {
    "languages": {
      "en": "EN",
      "zh": "中文"
    }
  },
  "soFar": {
    "title": "So Far",
    "meta": {
      "title": "Morris Liu - Rust & AI Infrastructure Experience | 7+ Years",
      "description": "Morris Liu's technical journey: Rust systems programming, AI infrastructure, and open source tools. Built EverCraft (enterprise CAD version control platform), X-Elephant (e-commerce AI sales agent), and Sealbox key management tool."
    },
    "resumeSummary": "CTO & Technical Architect • Built enterprise platforms from zero serving 20+ clients, led engineering team growth from 2 to 20 people, architected high-performance AI infrastructure with exceptional reliability and cost efficiency",
    "description": "I build software and lead teams. Currently working on AI infrastructure while side-building tools that solve real problems. This page captures the journey so far—the work, the projects, and the lessons learned.",
    "nav": [
      { "id": "work", "label": "Work", "href": "#work" },
      { "id": "projects", "label": "Projects", "href": "#projects" },
      { "id": "skills", "label": "Skills", "href": "#skills" },
      { "id": "side", "label": "Side", "href": "#side" },
      { "id": "contact", "label": "Contact", "href": "#contact" }
    ],
    "work": {
      "title": "Work",
      "description": "Seven years of growth from individual contributor to team leader. Each role taught me something different about technology, people, and the balance between moving fast and building things that last.",
      "positions": [
        {
          "year": "2024",
          "title": "Principal Engineer & AI Infrastructure Architect",
          "company": "UniXYZ",
          "period": "May 2024 - Present",
          "description": "Transitioned from enterprise CAD platforms to focus on cutting-edge AI infrastructure challenges. Architecting comprehensive AI stack (K8s + PostgreSQL + ClickHouse + RisingWave + Kafka + Qdrant) for enterprise e-commerce automation. Applied infrastructure optimization expertise to reduce memory usage from 200GB to 20-30GB and monthly cloud costs by 80%, achieving 99.95% SLA."
        },
        {
          "year": "2021",
          "title": "CTO",
          "company": "EverXYZ",
          "period": "Sep 2021 - May 2024",
          "description": "Promoted to CTO as company entered MiraclePlus (YC China) accelerator program. Led company growth from 4-person startup to 30+ team, scaling engineering from 2 to 20 people. Introduced Serverless processing with Knative for cost-efficient CAD model processing. Secured funding from prominent investors including Sequoia, ZhenFund, and MiraclePlus while driving revenue from zero to millions. As CTO, also contributed directly to business development, personally closing 5 enterprise clients."
        },
        {
          "year": "2020",
          "title": "Tech Lead & Team Manager",
          "company": "EverXYZ",
          "period": "Jan 2020 - Sep 2021",
          "description": "Built modern development organization from ground up, transforming from ad-hoc processes to structured 2-week sprint cycles with comprehensive CI/CD pipeline using GitLab. Based on deep insights into customer needs for managing mechanical design project files, proposed and implemented Git-inspired version control system, developed in Rust for performance optimization. Established automated testing framework and trunk-based development, while migrating architecture from single-machine deployment to high-availability K8s clusters. Mentored 2 fresh graduates and 3 junior engineers, with team members later taking key roles at other companies."
        },
        {
          "year": "2019",
          "title": "Full-Stack Engineer",
          "company": "EverXYZ",
          "period": "Feb 2019 - Dec 2019",
          "description": "Joined as employee #4 when company had only 2 technical staff total. Architected entire CAD platform from zero, focusing on 3D CAD model online preview functionality and simple single-file version control. Built EverCraft platform MVP using React and Next.js, delivering a complete minimum viable product loop that established the technical foundation for future development."
        },
        {
          "year": "2018",
          "title": "Frontend Engineer",
          "company": "Meituan",
          "period": "Jul 2018 - Jan 2019",
          "description": "Developed data analytics modules for multi-store management system handling significant daily transaction volumes. Built reusable component library that improved development efficiency, resolved critical cross-browser compatibility issues enhancing user experience across IE9+ and modern browsers."
        },
        {
          "year": "2017",
          "title": "Intern",
          "company": "Meituan",
          "period": "Jul 2017 - Sep 2017",
          "description": "Joined early-stage team for Kemanman project development. Implemented customer-facing membership card features supporting substantial user base, contributed core functionality that became foundational to the product's success."
        }
      ]
    },
    "projects": {
      "title": "Projects",
      "description": "A mix of professional work and personal exploration. The work projects showcase technical leadership and architecture design, while open source projects reflect my curiosity and problem-solving approach.",
      "workProjects": {
        "title": "Work Projects",
        "items": [
          {
            "title": "X-Elephant: AI for Sales & Support",
            "company": "UniXYZ",
            "period": "2024 - Present",
            "description": "Architected comprehensive AI infrastructure stack for enterprise e-commerce automation, enabling 24/7 multilingual customer service with 80%+ accuracy rates exceeding human agents.",
            "details": [
              "Infrastructure Architecture: Designed resilient AI platform combining transactional (PostgreSQL), analytical (ClickHouse), vector (Qdrant), and streaming (Kafka) databases with Kubernetes orchestration, achieving 99.95% SLA through strategic high-availability configurations.",
              "Memory Optimization: Developed custom Rust tooling for Qdrant data consolidation following vector database best practices, reducing memory footprint from 200GB to 20-30GB through intelligent data merging strategies, enabling 100+ real-time product updates per minute.",
              "Cost Engineering: Comprehensive system optimization reducing monthly cloud costs by 80% through multiple strategies: custom Rust tools for database optimization (handling 100M+ record tables), intelligent resource allocation, and infrastructure right-sizing.",
              "Business Impact: AI Sales Agent has generated millions of dollars in sales for clients, with chatbot providing superior accuracy compared to human customer service."
            ]
          },
          {
            "title": "EverCraft: Version Control System for CAD Files",
            "company": "EverXYZ",
            "period": "2019-2023",
            "description": "Architected enterprise SaaS platform bringing Git-inspired version control to CAD workflows, serving 20+ enterprise clients, driving millions revenue growth.",
            "details": [
              "System Architecture: Built distributed storage system managing massive CAD files with version tracking across 20+ supported formats, achieving 99.99% uptime with robust branching and merging capabilities.",
              "3D Visualization Integration: Integrated fractal3D engine for real-time browser-based CAD preview and collaborative annotation, enabling seamless engineering workflow integration.",
              "Business Development: Led technical strategy serving 20+ enterprise clients plus 100k+ free-tier users, personally closed 5 enterprise sales deals while scaling technical infrastructure."
            ]
          },
          {
            "title": "EverCraft Lite: Local CAD Version Control",
            "company": "EverXYZ",
            "period": "2023-2024",
            "description": "Built high-performance desktop CAD version control application using Rust and Tauri, achieving 1000+ paid subscribers with subscription and lifetime purchase models.",
            "details": [
              "Rust Performance Engineering: Developed cross-platform desktop application for Windows/macOS, delivering extremely fast local file processing with minimal memory usage and exceptional stability.",
              "File Processing Optimization: Engineered efficient handling of CAD files with optimized algorithms, demonstrating significant performance advantages over web-based solutions.",
              "Market Success: Achieved high monthly subscription retention rates with strong user satisfaction, serving individual engineers and small teams with reliable local version control solution."
            ]
          },
          {
            "title": "fractal3D: 3D CAD Visualization Engine",
            "company": "EverXYZ",
            "period": "2020-2024",
            "description": "Led development of WebGL-based 3D CAD visualization engine serving 10+ production clients with multi-million RMB revenue contribution to company growth.",
            "details": [
              "Team Leadership: Directed 5-person engineering team through complete product lifecycle from concept to production deployment, with end-users reaching significant monthly active usage through client platforms.",
              "WebGL Technical Innovation: Architected browser-based 3D rendering engine with industry-leading performance for large assembly loading, stably processing CAD components up to 500MB with optimized visualization.",
              "Production Integration: Enabled 10+ clients to integrate CAD model preview capabilities into their platforms, providing end-users with seamless 3D visualization directly in web browsers."
            ]
          }
        ]
      },
      "personalProjects": {
        "title": "Personal Projects",
        "items": [
          {
            "title": "Sealbox",
            "description": "A lightweight secret management service built with Rust. Single binary, SQLite storage, end-to-end encryption—designed for developers who want secure secret storage without enterprise complexity. Perfect for CI/CD, containers, and small teams.",
            "githubUrl": "https://github.com/realmorrisliu/sealbox",
            "readMoreLink": {
              "text": "→ Read the story behind this project in",
              "href": "/thoughts/why-i-built-sealbox",
              "linkText": "Why I Built Sealbox",
              "suffix": ""
            }
          },
          {
            "title": "openrouter-rs",
            "description": "Type-safe Rust SDK for OpenRouter.ai with async support and builder patterns. Leverages Rust's type system to make LLM API interactions predictable and memory-safe, supporting everything from simple completions to streaming responses.",
            "githubUrl": "https://github.com/realmorrisliu/openrouter-rs"
          },
          {
            "title": "funcall",
            "description": "A lightweight Rust library that transforms regular functions into dynamically callable JSON tools with a single `#[funcall]` macro. Minimal boilerplate, type-safe serialization, and runtime function invocation by name.",
            "githubUrl": "https://github.com/realmorrisliu/funcall"
          },
          {
            "title": "Kira",
            "description": "An AI assistant that captures context from everything you do—selected text, clipboard, files, conversations—then uses that rich context to help you develop and connect your ideas. Built for people who think better through conversation than traditional note-taking tools.",
            "readMoreLink": {
              "text": "→ Read more about the vision and design philosophy in",
              "href": "/thoughts/building-kira-an-ai-native-second-brain",
              "linkText": "Building Kira: An AI-Native Second Brain",
              "suffix": ""
            }
          }
        ]
      }
    },
    "skills": {
      "title": "Skills",
      "categories": [
        {
          "title": "Systems Programming",
          "stack": "Rust (systems + AI tooling), TypeScript, Go, Python — rare combination of low-level performance engineering with AI infrastructure expertise.",
          "philosophy": "Built production systems that consistently reduce costs 70-80% while improving reliability. Believe in 'performance as a feature' — users notice when software is fast and efficient."
        },
        {
          "title": "Infrastructure Architecture",
          "stack": "AI Infrastructure specialization: Vector databases (Qdrant), real-time analytics (ClickHouse), event streaming (Kafka), orchestrated with Kubernetes for enterprise scale.",
          "philosophy": "Built RAG systems for Shopify product information updates processing millions of events daily with second-level latency. Focus on intelligent resource allocation — the best infrastructure is invisible to users but obvious to cost accountants."
        },
        {
          "title": "Full-Stack Engineering",
          "stack": "WebGL 3D graphics, real-time data processing, cross-platform desktop applications (Tauri).",
          "philosophy": "End-to-end technical expertise from database performance tuning to browser-based 3D visualization, with emphasis on user experience and system efficiency."
        },
        {
          "title": "Engineering Leadership",
          "stack": "Scaled teams from 2 to 20 engineers, established modern development practices, mentored junior developers.",
          "philosophy": "Led through technical mentorship rather than hierarchy. Built sustainable engineering culture where senior engineers naturally emerge as technical leaders, resulting in scalable team growth from 2 to 20+ engineers."
        }
      ]
    },
    "side": {
      "title": "Side",
      "bass": "I spend time practicing bass, working through the grooves that shaped music—{queen}'s theatrical bass lines, {chic}'s infectious funk, {ewf}'s sophisticated arrangements, and {acdc}'s relentless drive. There's something about the bass that mirrors good engineering: it's the foundation that holds everything else together.",
      "photography": "When I'm not playing music, I'm often capturing moments through photography. I'm drawn to the philosophy of photographers like {cartierBresson}, who taught us about the decisive moment, and {hideakiHamada}, whose quiet observations of daily life reveal extraordinary beauty in the ordinary.",
      "philosophy": "Both photography and music have shaped how I think about code. Like a good composition or a perfectly timed shot, the best software feels inevitable once you experience it. I believe in building things that last, writing code that others can understand, and finding the rhythm that makes complex systems feel simple.",
      "photographers": {
        "cartierBresson": "Henri Cartier-Bresson",
        "hideakiHamada": "Hideaki Hamada"
      },
      "gear": {
        "title": "Current gear:",
        "items": ["Bass: YAMAHA TRBX604", "Camera: Leica M10-R"]
      }
    },
    "contact": {
      "title": "Contact",
      "github": {
        "text": "You can find me on ",
        "link": {
          "href": "https://github.com/realmorrisliu",
          "text": "GitHub"
        },
        "suffix": " where I share code and document technical experiments and ideas."
      },
      "twitter": {
        "text": "For more immediate thoughts and updates, I'm on ",
        "link": {
          "href": "https://twitter.com/realmorrisliu",
          "text": "X (Twitter)"
        },
        "suffix": "."
      },
      "email": {
        "text": "For everything else, email works well: ",
        "link": {
          "href": "mailto:morrisliu1994@outlook.com",
          "text": "morrisliu1994@outlook.com"
        },
        "suffix": ""
      }
    },
    "pdf": {
      "text": "You can also",
      "linkText": "download this as a PDF",
      "suffix": " if you prefer a traditional resume format.",
      "printButton": "Print PDF",
      "printButtonHint": "If the print dialog didn't open automatically, use the button above",
      "title": "PDF Resume Ready — Click 'Save as PDF' in the print dialog",
      "backText": "← Back to web version",
      "pageTitle": "Morris Liu - Resume (PDF)",
      "pageDescription": "Morris Liu's professional resume in PDF format. Full-Stack Engineer & Technical Leader with 7 years experience."
    },
    "footer": {
      "backToMain": "← Back to main page"
    }
  }
}
